Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>bv0qd9waKeSE3LkGtVyDiDxJ18dIJc1WK22OoZOSVoFLeIwCAlYeT8Mxc+kPdF0UuTgrih+hUyWw&#13;
9dT/VIQp+wXXmXpuyFDhIUa+t4OqIvxpolVfHJ30BbRtLb2Wx9FXnnsqIg+hom4J2XTgGfV8DEl0&#13;
rUfWTL4jlslprLoYuc3du5LqEapLZLnduy5TtWohx8WWc0J5chH3Imd8HmOTdz4C9be3+bBqk8s6&#13;
T9Z1/l23zRrkcO7LvWki5Jb/z99ysEufWPTddu4OF+CEyrSPb0irxT8FyOiR/aER8oCybveHKIru&#13;
D2Ae2A84qHaXBcRvj+f+LsNa2cC3DWaEbxQYIA==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>PVxCg3zz7TL08Z3/zOZLiWfeWRgzsWR8f3qe4A2g0E7jYaKzcm+BH1ktnoQylscFu4pU78ILZ2vK&#13;
yoeM38iUPU9uSduwbRjnDz6YTeN29ajH0cOXNNzIh7NJEULtsBYxI4vJa4YWxL1l/tZ+K81CnE0v&#13;
P0mhEK/XWoZsMs3/DkCRuP5d/SwzdkU4ZT7ZTejjF47uj88Cf/f9nVms8u+9E0X7layqPfMmeq4Z&#13;
knxZEaimUtsLZjQKAv+wmSu6qNoDm6sYwdAHZjO++hR4DzS6XNBx30fr43thgJuovfa2SqarWrs9&#13;
x5SPqES7n0orTL/+SIQyn9z0J1HdmbViZ6MryL/FUOJdm5NOS5FUcGilRZg/JZkDQq8HnRKAWGKY&#13;
bvjnLqcnEMQq+vc5polrlwLploWQAwXBdQOcuAkuSi9t4YBdcBvWu2JFXK+bGnaYLNTRtXp3sstE&#13;
q3y/5/NIzeOa0Zd2M3vUP5R4SlcjPDcRTDtoS3WPe96D2yzcdvpz4XWZHL+vSs3j7Pkqlx4uepgX&#13;
XXT3grBeVwgU74AqxEtOVLIuh6p/xENIIRFpQXeI4bYU62Hmgez+Sg19t2bK331Tvp69eFtPqRs9&#13;
hPdrgGoaPjsluCyIPfevIDfh4JqZcOHDHijaYUQA1jOUv5Qi9R+fx9ukQGQjI6vgdWYkGBEfIw6N&#13;
cyKXtaJInl+d+RjbnQVH0YlObKILVZ2Kz6QsXT3g6X+Il4dBXz8OxgLp4AsWSf/s4XRWFOcaRuuG&#13;
LfDv6kfwPXo1mOrAqLNClIb6IaAdSvwW33IMNydgCdTo0pxAVN2hNCJ21XSvBB26Kr8h1XUohmU1&#13;
2UBevRp2eEE1vaMatbPYQb7ovFf1/8DXkU4WmtXpsBb2Un6YGYJLCPpQUUhd85bksV//yd7iYfmK&#13;
rJAn5vxIjCMJ3L1GwDFhl1ubdWwKWe2QPytWzKPXUFYZplYIut2L1Yew8Z6X/9NfGcBP2DGKVxol&#13;
T3ccHKq7GREyMrk=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>zKzVLGBTUAcD+OMUxuZy8USI7eg=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
fzHYiUBcdGTAZI4Uu9EYHTBD0q0DG2q13NCNP0W3GgqSXhCZq3oNYlZao7RU07kMu9EHjLtotB0t&#13;
DLnqAz3Y9dHCZWVlaQ/NdH1LXfHjrULpBxwr5SuJznHWC+gDQsxNmYVxsZLJfYAmqYh4oFrqO0yj&#13;
eg225vjFVnsJ0eGwyD4wkPZK0DUOJa+hh//C+9JlxKRf/rjbykmLWVg/Pr7MYFBu+HVVpwf8k3Ul&#13;
IqJJbRMrw7iC4gbUQai8C0HI6laqQHKYlHU2bLbcdZBjoNb6T5wS/csFERtgXgQC+0avLX3UfE+m&#13;
1+k9BcYqY4UQmS5YGHjMmqDMDiZHE4+5TV8BLg==
</ds:SignatureValue>
<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
qvq9L4TdlpRND/aAnYa969IckeVyjGtDV1DHs/GvtFYRHuW6giXxjm3SUtVtTQoRTIoqBSLfpMBe&#13;
JODaAh6rACQpAgWymU4pbRXz7UIPhhpkyNeEXwtl63ILNOtIj6bMGtKnj6cmMYzNvUoQBixbFTSg&#13;
ixi3O996Z/YvRQLgW1obxiooCBoZuFEnFlfcUzCtHE5XmvZUWs4EjNA/oj9H2rJ34SMBz89XNyTl&#13;
0TBQh4ZPYw0WxzDJAyrtAGLWaPq1vOyA8PnXX33kQHGB7ZJVTVDlsFoD3ftWYQ63/LPshqM3P8BE&#13;
/uav8luUhVcVRDCDfvvpvmmJSVi7fK0zY4QQ7Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDgjCCAmqgAwIBAgIEWUhRPjANBgkqhkiG9w0BAQsFADB6MRAwDgYDVQQDDAdCYW5rYSBBMRAw&#13;
DgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcN&#13;
AQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIwHhcNMTcwNjE5MDAw&#13;
MDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQDDAdGaXJtYSBBMRAwDgYDVQQKDAdGaXJtYSBB&#13;
MQ4wDAYDVQQLDAVGaXJtYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcNAQkBFgtmaXJtYUBhLmNv&#13;
bTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE2MTQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK&#13;
AoIBAQCq+r0vhN2WlE0P9oCdhr3r0hyR5XKMa0NXUMez8a+0VhEe5bqCJfGObdJS1W1NChFMiioF&#13;
It+kwF4k4NoCHqsAJCkCBbKZTiltFfPtQg+GGmTI14RfC2Xrcgs060iPpswa0qePpyYxjM29ShAG&#13;
LFsVNKCLGLc733pn9i9FAuBbWhvGKigIGhm4UScWV9xTMK0cTlea9lRazgSM0D+iP0fasnfhIwHP&#13;
z1c3JOXRMFCHhk9jDRbHMMkDKu0AYtZo+rW87IDw+ddffeRAcYHtklVNUOWwWgPd+1ZhDrf8s+yG&#13;
ozc/wET+5q/yW5SFVxVEMIN+++m+aYlJWLt8rTNjhBDtAgMBAAGjEDAOMAwGA1UdEwEB/wQCMAAw&#13;
DQYJKoZIhvcNAQELBQADggEBABPql7l2SOkUU7ON9SEqNswIVn+RyAL+Y/9OBJ+0aU0lcvpgbFNZ&#13;
5GsCMufSLRK0z1HU2rKW969FAnxAbfvMAvTh8a1VKuSF1P259bjFSoCekPfDW8irKtdBwlXUQtfn&#13;
Av2mVWLhk9XhBQtN78BktFLuXG7aRfbgb6L/e9M6Z1XFM8QK5WzBo1Y/7C7js7R0thIX9OsBs0gD&#13;
yoK644NxtAH2JljgqREpcjKZwNhfXZ++SIK8O5zUM7hlo1C7N1XqkURhc7J5ADRIHf5cOJCqiE6d&#13;
Q2WnEbguq2W6D5tTN/qjfkOtu1AWa29vz3O2piue9WkfIqxC84/llz20jrIWfow=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>